{
  "did": "did:plc:hlchta7bwmobyum375ltycg5",
  "time_us": 1767832286636172,
  "kind": "commit",
  "commit": {
    "rev": "3mbuq5q3d2w2c",
    "operation": "create",
    "collection": "sh.tangled.repo.issue",
    "rkey": "3mbuq5pdywi22",
    "record": {
      "$type": "sh.tangled.repo.issue",
      "body": "Ok, this idea requires a bit of logical introduction.  For the short version of things, visit the current site for palettes, [4bitcss](https://4bitcss.com)\n\nA while back, I wanted a bunch of palettes for some sites, but I didn't want to go thru the painful exercise of building/naming N number of palettes.  In fact, I realized I didn't want _most_ people to have to go thru that slight hell.  \n\nImagine wanting to bring a selection of palettes to a client and trying to let them pick one.  Without a formal name, this would be a nightmare to even communicate (\"I like the purple-ish one.... which one?\").  The ideal would be to pick a popular store for palettes and derive a palette from that store, thus keeping standardized names that are easy to communicate.\n\nNext up was the desire to be able to render different major status types for conditions.  \n\nThink:  standard named colors for \"error\", \"warning\", and \"success\".\n\nWe _could_ reinvent the wheel here, or we _could_ look to palettes that somewhat define these already.\n\nThe answer I ended up at was to take existing [iTermColorSchemes palettes](https://github.com/mbadolato/iTerm2-Color-Schemes/) and generate a CSS version of each.\n\nThis ended up being very straightforward:\n\nEach palette consists of a series of named colors that match their names in a Windows Terminal profile.\n\nFor example, if you wanted a palette that looks like [Adventure Time](https://4bitcss.com/AdventureTime/) you can just create a CSS variable for each name in the [Windows Terminal Palette Json](https://github.com/mbadolato/iTerm2-Color-Schemes/blob/master/windowsterminal/Adventure%20Time.json) and _almost_ call it a day.\n\nBeyond being logically simple and getting hundreds of palettes right \"out of the box\", this approach also allows for cool synchronicity between a terminal and web ui experience.  \n\nIt's possible to use any of the color palettes within a page and use the exact same color palette in the terminal.\n\nNow I might be alone in thinking that's cool, but I don't think I am.\n\nLast but not least, if `site.standard.palette.terminal` or any such lexicon was standardized, it would be possible to make palettes easy to edit / share / aggregate.  This would allow any site to get a huge boon from using standard.site:  an endlessly expanding set of palettes would come \"for free\". \n\nTo clarify the schema in Markdown form:\n\n|Property|Type|Description|\n|-|-|-|\n| **`$type`** | `[string]` | The type of the object.  Must be `site.standard.color.palette`. |\n| **`name`** | `[string]` | The name of the palette |\n| **`colors`** | `[object]` | The named colors in the palette.  Must contain 'foreground, 'background'.  Should contain the standard 16 terminal colors |\n| **`luma`** | `[number]` | The luma value of the palette background, expressed as a number between 0 and 1 |\n| **`contrast`** | `[number]` | The contrast value of the palette foreground and background, expressed as a number between 0 and 1. |\n| colorscheme | [string] | Indicates if the palette is bright or dark.  Could theoretically be any valid [color-scheme](https://developer.mozilla.org/en-US/docs/Web/CSS/Reference/Properties/color-scheme)\n\nI hope I have made a compelling case for this type of palette declaration.\n\nI'm open to suggestions on the name.  Was originally thinking:\n`site.standard.palette.(terminal|named|rich|colors)`, and then the very obvious logically NSID hit me:\n\n`site.standard.color.palette`",
      "createdAt": "2026-01-08T00:31:24+00:00",
      "repo": "at://did:plc:re3ebnp5v7ffagz6rb6xfei4/sh.tangled.repo/3mbriu65fu522",
      "title": "suggested lexicon: `site.standard.color.palette`"
    },
    "cid": "bafyreibajwpxqbabbxy64pkhgitmre5rw4r4l34im7y7py2tvzlq2k57ge"
  }
}